tap "louisbrunner/valgrind"
tap "oven-sh/bun"
brew "xz"
brew "openssl@3"
brew "freetype"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "cmocka"
brew "ruby"
brew "cocoapods"
brew "cpanminus"
brew "protobuf"
brew "criterion"
brew "curl"
brew "e2fsprogs"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "grpc"
brew "pkgconf"
brew "htop"
brew "icu4c@76"
brew "john-jumbo"
brew "lazygit"
brew "less"
brew "luajit"
brew "mole"
brew "neovim"
brew "ninja"
brew "node"
brew "octave"
brew "ripgrep"
brew "opencode"
brew "perl"
brew "powerlevel10k"
brew "zig"
brew "zls"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
cask "betterdisplay"
cask "claude-code"
cask "codex"
cask "font-hack-nerd-font"
cask "ghostty"
cask "gimp"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "stats"
cask "visual-studio-code"
cask "zed"
vscode "adarshrkumar.pscode"
vscode "adpyke.codesnap"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "humao.rest-client"
vscode "humy2833.ftp-simple"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kabak.asm"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mohsen1.prettify-json"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-serial-monitor"
vscode "pbkit.vscode-pbkit"
vscode "platformio.platformio-ide"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "wayou.vscode-todo-highlight"
vscode "whatwedo.twig"
vscode "willumz.generic-pseudocode"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "ziglang.vscode-zig"
vscode "zobo.php-intellisense"
